
const Service = require('../api/modelsMongoose/service');
const Diagnosis = require('../api/modelsMongoose/diagnosis');
const Tooth = require('../api/modelsMongoose/tooth');

exports.generateDb = async () => {

    const diagnosisForSave = [
        {
            "id": 11647525,
            "name": "Гострий гнійний періодонтит",
            "complaints": "Різкий біль при накушуванні на зуб; Постійний пульсуючий, наростаючий біль в зубі, відчуття “вирослого зуба”.",
            "research": "Зондування стінок, дна каріозної порожнини, місця сполучення з порожниною зуба та устя кореневих каналів безболісне, відсутня реакція на термічні подразники; Болісна реакція на перкусію зуба (вертикальну і горизонтальну), патологічна рухомість зуба, слизова оболонка ясен та перехідної складки у ділянці верхівки ураженого зуба, набрякла, гіперемована, згладжена, болісна при пальпації;",
            "treatment": ""
        },
        {
            "id": 11647526,
            "name": "Гінгівіт катаральний (хронічний перебіг)",
            "complaints": "Скарги на періодичну кровоточивість ясен під час чищення зубів, незначно виражена гіперемія слизової оболонки ясен.",
            "research": "Ціаноз слизової оболонки ясен, помірний набряк слизової оболонки ясен, наявність зубного нальоту,",
            "treatment": ""
        },
        {
            "id": 11647530,
            "name": "Поверхневий карієс зуба",
            "complaints": "Скарги на незначний біль, а частіше відчуття оскоми в зубі, які виникають від хімічних подразників і швидко проходять після припинення їх дії,короткочасний біль від температурних та механічних подразників, частіше в місці локалізації дефекту",
            "research": "Каріозна порожнина розташована у межах емалі зі збереженням цілості емалево-дентинного з’єднання, при зондуванні відмічається шорсткість, розм’якшення емалі, затримка зонда, в ділянці крейдоподібного кольору ураження емалі виявляється неглибокий дефект (порожнина), розміщена в межах емалі, краї дефекту нерівні.",
            "treatment": ""
        },
        {
            "id": 11647531,
            "name": "Повна адентія",
            "complaints": "Скарги на відсутність зубів",
            "research": "",
            "treatment": ""
        },
        {
            "id": 11647532,
            "name": "Клиновидний дефект",
            "complaints": "Скарги відсутні. Чутливість до механічних і хімічних подразників",
            "research": "В пришийковій ділянці зуба дефект твердих тканин в межах емалі. Зондування - реакція на подразники не болюча.",
            "treatment": "Пломбування дефекту фотополімерним матеріалом"
        },
        {
            "id": 11647533,
            "name": "Гострий гнійний періодонтит",
            "complaints": "Різкий біль при накушуванні на зуб; Постійний пульсуючий, наростаючий біль в зубі, відчуття “вирослого зуба”.",
            "research": "Зондування стінок, дна каріозної порожнини, місця сполучення з порожниною зуба та устя кореневих каналів безболісне, відсутня реакція на термічні подразники; Болісна реакція на перкусію зуба (вертикальну і горизонтальну), патологічна рухомість зуба, слизова оболонка ясен та перехідної складки у ділянці верхівки ураженого зуба, набрякла, гіперемована, згладжена, болісна при пальпації;",
            "treatment": ""
        },
        {
            "id": 11647534,
            "name": "Карієс",
            "complaints": "",
            "research": "",
            "treatment": ""
        },
        {
            "id": 11647535,
            "name": "Гінгівіт катаральний (хронічний перебіг)",
            "complaints": "Скарги на періодичну кровоточивість ясен під час чищення зубів, незначно виражена гіперемія слизової оболонки ясен.",
            "research": "Ціаноз слизової оболонки ясен, помірний набряк слизової оболонки ясен, наявність зубного нальоту,",
            "treatment": ""
        },
        {
            "id": 11647536,
            "name": "Перелом коронки зуба",
            "complaints": "Тріщина коронки зуба",
            "research": "Наявний перелом коронки зуба\r\nРентгенологічно проявляється тріщина в ділянці коронки зуба\r\nРеакція на подразники не болюча",
            "treatment": "Терапевтичне чи ортопедичне лікування"
        },
        {
            "id": 11647537,
            "name": "Хронічний середній карієс",
            "complaints": "Скарги на незначний біль, а частіше відчуття оскоми в зубі, які виникають від хімічних подразників і швидко проходять після припинення їх дії, короткочасний біль від температурних та механічних подразників.",
            "research": "Каріозна порожнина розміщена у межах плащового дентину, краї дефекту нерівні пігментовані, зондування каріозної порожнини мало болісне за винятком стінок у ділянці емалево-дентинного з’єднання, при зондуванні відмічається шорсткість, розм’якшення емалі, розм’якшений дентин, який вистилає каріозну порожнину пігментований.",
            "treatment": ""
        },
        {
            "id": 11647539,
            "name": "Хронічний глибокий карієс",
            "complaints": "Скарги на короткочасний біль від хімічних, температурних та механічних подразників, наявність порожнини в зубі.",
            "research": "Каріозна порожнина має широкий вхідний отвір, її ширина практично однакова біля емалево-дентинного з’єднання і поблизу пульпи, зондування каріозної порожнини мало болісне за винятком стінок у ділянці емалево-дентинного з’єднання, реакція на перкусію - безболісна.",
            "treatment": ""
        },
        {
            "id": 11647540,
            "name": "Гострий глибокий карієс",
            "complaints": "Скарги на біль, а частіше відчуття оскоми в зубі, які виникають від хімічних подразників і швидко проходять після припинення їх дії, біль від температурних та механічних подразників,",
            "research": "Каріозна порожнина розміщена у межах навколопульпарного дентину з навислими краями емалі,\r\nкаріозна порожнина має відносно вузький вхідний отвір, найбільшу ширину біля емалево-дентинного з’єднання і поступово розширяється у напрямку до пульпи, при зондуванні відмічається болісність в ділянці емалево-дентинного з’єднання, а також (менш виражена) на дні порожнини.\r\nПеркусія безболісна.",
            "treatment": ""
        },
        {
            "id": 11647542,
            "name": "Початковий пульпіт (гіперемія)",
            "complaints": "Скарги на локалізований самочинний біль 1-3 хв. з великими проміжками до 12-24 години, біль від температурних подразників, протягом 1-3 хв, больові приступи частіше виникають в нічний час, біль виникла вперше добу тому.",
            "research": "Обєктивно в зубі глибока каріозна порожнина,  в межах навколопульпарного дентину, дентин розм’якшений, при зондуванні виявляється помірний біль у ділянці проекції рогу пульпи від холодної води виникає біль, що триває 1-2 хвилини, перкусія зуба безболісна.",
            "treatment": ""
        },
        {
            "id": 11647543,
            "name": "Гострий пульпіт (обмежений)",
            "complaints": "Скарги на біль гострий, локалізований, нападоподібний, самовільний, тривалість приступу 15-30 хв., без больові проміжки – 2-3 години, напад болю може виникнути під впливом різних подразників (температурних, хімічних тощо), больові приступи підсилюються і частішають вночі біль виник вперше 2-3 доби тому.",
            "research": "Об'єктивно в зубі глибока каріозна порожнина в межах навколопульпарного дентину, дентин розм’якшений, при зондуванні виявляється помірний біль в точці, відповідно проекції запаленого рогу пульпи, від холодної води виникає приступ болю, перкусія зуба безболісна.",
            "treatment": ""
        },
        {
            "id": 11647544,
            "name": "Гострий пульпіт (дифузний)",
            "complaints": "Скарги на біль гострий, ірадіюючий, нападоподібний, самовільний, тривалість приступу 2-4 год., без больові проміжки – 10-30 хвилин, іррадіація болю, больові приступи підсилюються і частішають вночі біль виник вперше 2-3 доби тому.",
            "research": "Об'єктивно, в зубі глибока каріозна порожнина в межах навколопульпарного дентину, дентин розм’якшений, при зондуванні виявляється біль по всьому дну каріозної порожнини, від холодної води виникає приступ болю.",
            "treatment": ""
        },
        {
            "id": 11647545,
            "name": "Гострий пульпіт (гнійний )",
            "complaints": "Скарги на біль гострий, ірадіюючий, нападоподібний, самовільний, пульсуючий, хвилеподібний,  безбольові проміжки відсутні, іррадіація болю, напад болю може виникнути під впливом різних подразників, больові приступи підсилюються і частішають вночі, біль виник вперше 2-3 доби тому.",
            "research": "Об'єктивно глибока каріозна порожнина в межах навколопульпарного дентину, дентин розм’якшений пігментований, при зондуванні виявляється біль по всьому дну каріозної порожнини, каріозна порожнина сполучається із пульповою камерою, больова реакція при вертикальній перкусії ураженого зуба.",
            "treatment": ""
        },
        {
            "id": 11647546,
            "name": "Гострий пульпіт (травматичний)",
            "complaints": "Травма зуба",
            "research": "оголена пульпа яскраво-червоного кольору\r\n\r\nВиникає гострий, короткочасний біль, який посилюється під час зондування в зоні травми",
            "treatment": ""
        },
        {
            "id": 11647547,
            "name": "З метою санації",
            "complaints": "Відсутні",
            "research": "-",
            "treatment": ""
        },
        {
            "id": 11647548,
            "name": "Флюороз",
            "complaints": "Скарни на наявні коричневі плями на поверхні зуба",
            "research": "Плями коричневого кольору з ураженням та демінералізацією емалі зуба",
            "treatment": ""
        },
        {
            "id": 11647549,
            "name": "Гінгівіт гіпертрофічний (Фіброзна форма)",
            "complaints": "Скарги на незвичний вигляд ясен",
            "research": "Гіпертрофія ясенних сосочків вигляду стовщеного у своїй основі валика та округлої форми гіпертрофованих сосочків,гіпертрофовані ясна різко виступають у присінок порожнини рота, що зумовлює деформацію рельєфу ясен.",
            "treatment": ""
        },
        {
            "id": 11647550,
            "name": "Пародонтит генералізований ( 2 ступінь)",
            "complaints": "Скарги на неприємний запах з рота, незначну кровоточивість та болісність ясен, які виникають при прийманні твердої їжі; зміщення зубів, появу проміжків між зубами та їх рухомість, наявність місцевих подразників.",
            "research": "Наявний симптоматичний гінгівіт, оголення шийок зубів на 2-3 мм, пародонтальні кишені глибиною 3-5 мм заповнені грануляціями і серозно-гнійним ексудатом, рухомість зубів І-ІІ ступеня, рентгенологічно кортикальна пластинка порушена, резорбція альвеолярної кістки досягає половини висоти міжальвеолярних перегородок. Відмічається утворення кісткових кишень різної глибини.",
            "treatment": ""
        },
        {
            "id": 11647551,
            "name": "Хронічний гангренозний пульпіт",
            "complaints": "Скарги на біль ниючого, тягнучого характеру на дію термічних теплових подразників (гаряча їжа тощо), який повільно зникає після усунення подразника\r\nнеприємне відчуття розпирання в зубі.",
            "research": "Глибока каріозна порожнина в межах навколопульпарного дентину, що з’єднується з порожниною зуба дентин розм’якшений, пігментований \r\nзондування дна каріозної порожнини практично безболісне, у місці перфорації поверхневе зондування - безболісне, глибоке зондування викликає біль і кровоточивість.",
            "treatment": ""
        },
        {
            "id": 11647552,
            "name": "Поверхневий карієс, хронічний перебіг",
            "complaints": "Скарги на наявність коричневого кольору плями на поверхні емалі, короткочасний біль від хімічних, температурних та механічних подразників (який відразу припиняється після їх усунення).",
            "research": "Каріозна порожнина має широкий, розкритий, без навислих країв вхідний отвір,\r\nураження виповнені досить щільною емаллю коричневого кольору, при зондуванні відмічається шорсткість, розм’якшення емалі, затримка зонда, при зондуванні відмічається шорсткість, розм’якшення емалі, затримка зонда.",
            "treatment": ""
        },
        {
            "id": 11647553,
            "name": "Папіліт",
            "complaints": "на ниючу біль в ділянці зубів при розжовуванні твердої їжі",
            "research": "в ділянці ясенного сосочка гіперемія, опухлість, згладженість вершини, болючість і кровоточивість при пальпації",
            "treatment": "Склерозуюча терапія"
        },
        {
            "id": 11647554,
            "name": "Гострий середній карієс",
            "complaints": "Скарги на незначний біль, а частіше відчуття оскоми в зубі, які виникають від хімічних подразників і швидко проходять після припинення їх дії, короткочасний біль від температурних та механічних подразників.",
            "research": "При зондуванні відмічається шорсткість, розм’якшення емалі, розм’якшений дентин, який вистилає каріозну порожнину сіро-білого кольору,зондування каріозної порожнини мало болісне за винятком стінок в ділянці емалево-дентинного з’єднання, реакція на перкусію - безболісна.",
            "treatment": ""
        },
        {
            "id": 11647556,
            "name": "Пародонтит локалізований ( 1 ступінь)",
            "complaints": "Кровоточивість ясен, неприємний запах з рота, біль при вживанні їжі.",
            "research": "Зміна кольору і рельефу ясен (симптоматичний гінгівіт), порушення цілісності зубоясенного сполучення (утворення пародонтальної кишені), травматична оклюзія, резорбція кістки альвеолярного відростка на обмеженій ділянці щелепи )",
            "treatment": ""
        },
        {
            "id": 11647558,
            "name": "Пародонтит генералізований (Початковий ступінь)",
            "complaints": "Скарги на кровоточивість ясен при жуванні, чищенні зубів, неприємні відчуття у пародонті, свербіж і свербіжута оніміння в яснах.",
            "research": "Утворення ясенної кишені внаслідок запальних змін в яснах та їх набряку, відмічається порушення цілісності зубоепітеліального прикріплення та проростання епітелію вглиб періодонта, відкладення надясенного зубного каменю з язикового боку нижніх фронтальних зубів і на присінковій поверхні верхніх молярів",
            "treatment": ""
        },
        {
            "id": 11647559,
            "name": "Часткова адентія",
            "complaints": "Скарги на відсутність зубів",
            "research": "",
            "treatment": ""
        },
        {
            "id": 11647560,
            "name": "Поверхневий карієс, хронічний перебіг",
            "complaints": "Скарги на наявність коричневого кольору плями на поверхні емалі, короткочасний біль від хімічних, температурних та механічних подразників (який відразу припиняється після їх усунення).",
            "research": "Каріозна порожнина має широкий, розкритий, без навислих країв вхідний отвір,\r\nураження виповнені досить щільною емаллю коричневого кольору, при зондуванні відмічається шорсткість, розм’якшення емалі, затримка зонда, при зондуванні відмічається шорсткість, розм’якшення емалі, затримка зонда.",
            "treatment": ""
        },
        {
            "name": "Гінгівіт виразковий",
            "complaints": "Скарги на біль у яснах, гнилісний запах з рота, кровоточивість, утруднення приймання їжі, інколи біль при ковтанні, тризм.",
            "research": "Яскрава гіперемія, набряк, кровоточивість ясен, некроз ясенного краю і верхівок міжзубних сосочків білувато-брудносірого кольору, після видалення нальоту і некротичної тканини оголюється кровоточива, болісна при пальпації виразкова поверхня",
            "treatment": ""
        },
        {
            "name": "Пародонтит генералізований (1 ступінь)",
            "complaints": "Скарги на кровоточивість ясен, неприємний запах з рота; свербіж, кровоточивість ясен, наявність місцевих подразників.",
            "research": "Симптоматичний гінгівіт, пародонтальні кишені глибиною 1-3 мм містять серозно-гнійні виділення у незначній кількості, рухомість зубів І ступеня. Рентгенологічно виявляється повна деструкція кортикального шару, розширення періодонтальної щілини на верхівках міжальвеолярних перегородок, остеопороз губчатої речовини та резорбція в межах верхньої третини їх висоти.",
            "treatment": ""
        },
        {
            "name": "Гінгівіт катаральний (хронічний перебіг)",
            "complaints": "Скарги на періодичну кровоточивість ясен під час чищення зубів, незначно виражена гіперемія слизової оболонки ясен.",
            "research": "Ціаноз слизової оболонки ясен, помірний набряк слизової оболонки ясен, наявність зубного нальоту,",
            "treatment": ""
        },
        {
            "name": "Поверхневий карієс, хронічний перебіг",
            "complaints": "Скарги на наявність коричневого кольору плями на поверхні емалі, короткочасний біль від хімічних, температурних та механічних подразників (який відразу припиняється після їх усунення).",
            "research": "Каріозна порожнина має широкий, розкритий, без навислих країв вхідний отвір,\r\nураження виповнені досить щільною емаллю коричневого кольору, при зондуванні відмічається шорсткість, розм’якшення емалі, затримка зонда, при зондуванні відмічається шорсткість, розм’якшення емалі, затримка зонда.",
            "treatment": ""
        },
        {
            "name": "Катаральний гінгівіт (гострий перебіг)",
            "complaints": "Скарги на біль, кровоточивість, набряк ясен, паління в уражених ділянках, біль та кровоточивість підсилюються при прийманні їжі, розмові, її інтенсивність зростає в міру розвитку запалення.",
            "research": "Яскраво виражена гіперемія ясен, набряк, більше виражений в ділянці ясенного краю та біля основи ясенних сосочків, ясна легко кровоточать при пальпації, посилене відкладання на зубах нальоту.",
            "treatment": ""
        },
        {
            "name": "Гінгівіт гіпертрофічний",
            "complaints": "Скарги на розростання ясен, свербіж, незначну кровоточивість та болісність, які підсилюються при прийманні їжі; розростання ясен, яке може порушувати акт жування, неприємний запах з рота.",
            "research": "Гіперплазія ясенних сосочків з різко вираженим ціанозом, пастозність, пухкість тканини, болісність при пальпації, підсилена кровоточивість, ясенний край стовщений, альвеолярні ясна знаходяться в стані катарального запалення, форма ясенних сосочків змінена.",
            "treatment": ""
        },
        {
            "name": "Пульпіт ускладнений періодонтитом",
            "complaints": "Скарги на ірадіюючий біль, що виникає самовільно та посилюється, як від різноманітних подразників, так і вночі, біль має наростаючий пульсуючий характер, посилюється при накушуванні на зуб, світлі проміжки між больовими приступами майже відсутні.",
            "research": "Глибока каріозна порожнина в межах навколопульпарного дентину, дентин розм’якшений, бути пігментований, зондування дна каріозної порожнини болісне, реакція на перкусію – болісна, м'які тканини навколо даного зуба набряклі, гіперемовані, болісні при пальпації, перехідна складка згладжена.",
            "treatment": ""
        },
        {
            "name": "Повна адентія",
            "complaints": "Скарги на відсутність зубів",
            "research": "",
            "treatment": ""
        },
        {
            "name": "Гострий серозний періодонтит",
            "complaints": "Скарги на різкий біль при накушуванні на зуб; Постійний пульсуючий, наростаючий біль в зубі.",
            "research": "Зондування стінок, дна каріозної порожнини, місця сполучення з порожниною зуба та устя кореневих каналів безболісне, відсутня реакція на термічні подразники; Болісна реакція на перкусію зуба, патологічна рухомість зуба, слизова оболонка ясен та перехідної складки у ділянці верхівки ураженого зуба, набрякла, болісна при пальпації.",
            "treatment": ""
        },
        {
            "name": "Клиновидний дефект",
            "complaints": "Скарги відсутні. Чутливість до механічних і хімічних подразників",
            "research": "В пришийковій ділянці зуба дефект твердих тканин в межах емалі. Зондування - реакція на подразники не болюча.",
            "treatment": "Пломбування дефекту фотополімерним матеріалом"
        },
        {
            "name": "Гострий гнійний періодонтит",
            "complaints": "Різкий біль при накушуванні на зуб; Постійний пульсуючий, наростаючий біль в зубі, відчуття “вирослого зуба”.",
            "research": "Зондування стінок, дна каріозної порожнини, місця сполучення з порожниною зуба та устя кореневих каналів безболісне, відсутня реакція на термічні подразники; Болісна реакція на перкусію зуба (вертикальну і горизонтальну), патологічна рухомість зуба, слизова оболонка ясен та перехідної складки у ділянці верхівки ураженого зуба, набрякла, гіперемована, згладжена, болісна при пальпації;",
            "treatment": ""
        },
        {
            "name": "Гіпоплазія емалі",
            "complaints": "На косметичний дефект зубів",
            "research": "Об\"єктивно: часткова відсутність емалі внаслідок чого - зміна форми зуба.\r\nЗондування неболюче, реакція на температурні подразники слабоболюча.",
            "treatment": "Застосовується реставраційна тех­ніка: анатомічна форма зубів відновлюється за допомогою компози­ційних матеріалів.\r\nРемінералізуюча терапія."
        },
        {
            "name": "Хронічний апікальний періодонтит постійного зуба",
            "complaints": "Скарги на наявність каріозної порожнини в зубі.",
            "research": "Зондування стінок, дна каріозної порожнини і місця сполучення з порожниною зуба та входу до кореневих каналів безболісне, відсутня реакція при дії термічних подразників; Реакція на вертикальну і горизонтальну перкусію – безболісна, слизова оболонка ясен в проекції верхівки кореня ураженого зуба незначно застійно гіперемована, набрякла;",
            "treatment": ""
        },
        {
            "name": "Карієс",
            "complaints": "",
            "research": "",
            "treatment": ""
        },
        {
            "name": "Гіперестезія зубів",
            "complaints": "на підвищену чутливість до термічних та хімічних подразників.",
            "research": "Тверді тканини зубів без видимих змін. Зондування місцево болюче, реакція на хімічний, температурний подразник - швидкоминучий біль",
            "treatment": "Місцево препарати для зниження чутливості емалі.\r\nПризначення десенситайзерів."
        },
        {
            "name": "Загострений хронічний періодонтит",
            "complaints": "Скарги на різкий біль при накушуванні на зуб, постійний пульсуючий, наростаючий біль в зубі; Відчуття “вирослого зуба, асиметрія обличчя за рахунок набряку м’яких тканин на стороні ураження;",
            "research": "Зондування стінок, дна каріозної порожнини, місця сполучення з порожниною зуба та устя кореневих каналів безболісне, відсутня реакція на термічні подразники; Болісна реакція на перкусію зуба (вертикальну і горизонтальну), патологічна рухомість зуба, слизова оболонка ясен та перехідної складки у ділянці верхівки ураженого зуба, набрякла, гіперемована, згладжена, болісна при пальпації;",
            "treatment": ""
        },
        {
            "name": "Гінгівіт катаральний (хронічний перебіг)",
            "complaints": "Скарги на періодичну кровоточивість ясен під час чищення зубів, незначно виражена гіперемія слизової оболонки ясен.",
            "research": "Ціаноз слизової оболонки ясен, помірний набряк слизової оболонки ясен, наявність зубного нальоту,",
            "treatment": ""
        },
        {
            "name": "Поверхневий карієс зуба",
            "complaints": "Скарги на незначний біль, а частіше відчуття оскоми в зубі, які виникають від хімічних подразників і швидко проходять після припинення їх дії,короткочасний біль від температурних та механічних подразників, частіше в місці локалізації дефекту",
            "research": "Каріозна порожнина розташована у межах емалі зі збереженням цілості емалево-дентинного з’єднання, при зондуванні відмічається шорсткість, розм’якшення емалі, затримка зонда, в ділянці крейдоподібного кольору ураження емалі виявляється неглибокий дефект (порожнина), розміщена в межах емалі, краї дефекту нерівні.",
            "treatment": ""
        },
        {
            "name": "Гіперестезія зубів",
            "complaints": "на підвищену чутливість до термічних та хімічних подразників.",
            "research": "Тверді тканини зубів без видимих змін. Зондування місцево болюче, реакція на хімічний, температурний подразник - швидкоминучий біль",
            "treatment": "Місцево препарати для зниження чутливості емалі.\r\nПризначення десенситайзерів."
        },
        {
            "name": "Гінгівіт катаральний (хронічний перебіг)",
            "complaints": "Скарги на періодичну кровоточивість ясен під час чищення зубів, незначно виражена гіперемія слизової оболонки ясен.",
            "research": "Ціаноз слизової оболонки ясен, помірний набряк слизової оболонки ясен, наявність зубного нальоту,",
            "treatment": ""
        },
        {
            "name": "Гінгівіт катаральний (хронічний перебіг)",
            "complaints": "Скарги на періодичну кровоточивість ясен під час чищення зубів, незначно виражена гіперемія слизової оболонки ясен.",
            "research": "Ціаноз слизової оболонки ясен, помірний набряк слизової оболонки ясен, наявність зубного нальоту,",
            "treatment": ""
        },
        {
            "name": "Гострий гнійний періодонтит",
            "complaints": "Різкий біль при накушуванні на зуб; Постійний пульсуючий, наростаючий біль в зубі, відчуття “вирослого зуба”.",
            "research": "Зондування стінок, дна каріозної порожнини, місця сполучення з порожниною зуба та устя кореневих каналів безболісне, відсутня реакція на термічні подразники; Болісна реакція на перкусію зуба (вертикальну і горизонтальну), патологічна рухомість зуба, слизова оболонка ясен та перехідної складки у ділянці верхівки ураженого зуба, набрякла, гіперемована, згладжена, болісна при пальпації;",
            "treatment": ""
        },
        {
            "name": "Гінгівіт гіпертрофічний",
            "complaints": "Скарги на розростання ясен, свербіж, незначну кровоточивість та болісність, які підсилюються при прийманні їжі; розростання ясен, яке може порушувати акт жування, неприємний запах з рота.",
            "research": "Гіперплазія ясенних сосочків з різко вираженим ціанозом, пастозність, пухкість тканини, болісність при пальпації, підсилена кровоточивість, ясенний край стовщений, альвеолярні ясна знаходяться в стані катарального запалення, форма ясенних сосочків змінена.",
            "treatment": ""
        },
        {
            "name": "Часткова адентія",
            "complaints": "Скарги на відсутність зубів",
            "research": "",
            "treatment": ""
        },
        {
            "name": "Пародонтит локалізований (3 ступінь)",
            "complaints": "Скарги на кровоточивість ясен при чищенні зубів та прийомі твердої їжі на уражену ділянку, рухомість зубів.",
            "research": "Симптоматичний гінгівіт, наявні пародонтальні кишені глибиною 5-8 мм містять серозно-гнійні виділення у незначній кількості,ретракція ясен, рухомість зубів ІІ-ІІІ ступеня, рентгенологічно кортикальна пластинка порушена, резорбція альвеолярної кістки досягає 2/3 висоти міжальвеолярних перегородок. Відмічається утворення кісткових кишень різної глибини.",
            "treatment": ""
        },
        {
            "name": "Хронічний гангренозний пульпіт",
            "complaints": "Скарги на біль ниючого, тягнучого характеру на дію термічних теплових подразників (гаряча їжа тощо), який повільно зникає після усунення подразника\r\nнеприємне відчуття розпирання в зубі.",
            "research": "Глибока каріозна порожнина в межах навколопульпарного дентину, що з’єднується з порожниною зуба дентин розм’якшений, пігментований \r\nзондування дна каріозної порожнини практично безболісне, у місці перфорації поверхневе зондування - безболісне, глибоке зондування викликає біль і кровоточивість.",
            "treatment": ""
        },
        {
            "name": "Поверхневий карієс зуба",
            "complaints": "Скарги на незначний біль, а частіше відчуття оскоми в зубі, які виникають від хімічних подразників і швидко проходять після припинення їх дії,короткочасний біль від температурних та механічних подразників, частіше в місці локалізації дефекту",
            "research": "Каріозна порожнина розташована у межах емалі зі збереженням цілості емалево-дентинного з’єднання, при зондуванні відмічається шорсткість, розм’якшення емалі, затримка зонда, в ділянці крейдоподібного кольору ураження емалі виявляється неглибокий дефект (порожнина), розміщена в межах емалі, краї дефекту нерівні.",
            "treatment": ""
        },
        {

            "name": "Хронічний початковий карієс",
            "complaints": "Скарги на косметичний дефект твердих тканин зуба (виникнення пігментованої плями), больові відчуття відсутні, плями з’явились після прорізування зуба.",
            "research": "Пляма при зондуванні гладка зонд не застрягає, пляма при зафарбовуванні зафарбовується в колір маркера.",
            "treatment": ""
        },
        {
            "name": "Хронічний початковий карієс",
            "complaints": "Скарги на косметичний дефект твердих тканин зуба (виникнення пігментованої плями), больові відчуття відсутні, плями з’явились після прорізування зуба.",
            "research": "Пляма при зондуванні гладка зонд не застрягає, пляма при зафарбовуванні зафарбовується в колір маркера.",
            "treatment": ""
        },
        {
            "name": "Гінгівіт гіпертрофічний",
            "complaints": "Скарги на розростання ясен, свербіж, незначну кровоточивість та болісність, які підсилюються при прийманні їжі; розростання ясен, яке може порушувати акт жування, неприємний запах з рота.",
            "research": "Гіперплазія ясенних сосочків з різко вираженим ціанозом, пастозність, пухкість тканини, болісність при пальпації, підсилена кровоточивість, ясенний край стовщений, альвеолярні ясна знаходяться в стані катарального запалення, форма ясенних сосочків змінена.",
            "treatment": ""
        },
        {
            "name": "Пародонтит локалізований ( 2 ступінь)",
            "complaints": "Скарги на неприємний запах з рота, незначну кровоточивість та болісність ясен, які виникають при прийманні твердої їжі;",
            "research": "Наявний симптоматичний гінгівіт, оголення шийок зубів на 2-3 мм, пародонтальні кишені глибиною 3-5 мм заповнені грануляціями і серозно-гнійним ексудатом, рухомість зубів І-ІІ ступеня, рентгенологічно кортикальна пластинка порушена, резорбція альвеолярної кістки досягає половини висоти міжальвеолярних перегородок. Відмічається утворення кісткових кишень різної глибини.",
            "treatment": ""
        },
        {
            "name": "Пародонтит генералізований (3 ступінь)",
            "complaints": "Скарги на неприємний запах з рота, незначну кровоточивість, болісність ясен та виражену рухомість зубів, що утруднює приймання їжі; зміщення зубів, появу проміжків між зубами, відмічаються косметичні недоліки,  наявність місцевих подразників.",
            "research": "Виражена травматична оклюзія, діагностується візуально, симптоматичний гінгівіт, оголення шийок зубів на 5-8 мм, пародонтальні кишені заповнені грануляціями і серозно-гнійним ексудатом, рухомість зубів  І-ІІ-ІІІ ступеня, виражена по-різному на різних ділянках щелеп, рентгенологічно кортикальна пластинка порушена, резорбція альвеолярної кістки досягає 2/3 висоти міжальвеолярних перегородок. Відмічається утворення кісткових кишень різної глибини.",
            "treatment": ""
        },
        {
            "name": "Хронічний апікальний періодонтит постійного зуба",
            "complaints": "Скарги на наявність каріозної порожнини в зубі.",
            "research": "Зондування стінок, дна каріозної порожнини і місця сполучення з порожниною зуба та входу до кореневих каналів безболісне, відсутня реакція при дії термічних подразників; Реакція на вертикальну і горизонтальну перкусію – безболісна, слизова оболонка ясен в проекції верхівки кореня ураженого зуба незначно застійно гіперемована, набрякла;",
            "treatment": ""
        },
        {
            "name": "Карієс",
            "complaints": "",
            "research": "",
            "treatment": ""
        },
        {
            "name": "Гіперестезія зубів",
            "complaints": "на підвищену чутливість до термічних та хімічних подразників.",
            "research": "Тверді тканини зубів без видимих змін. Зондування місцево болюче, реакція на хімічний, температурний подразник - швидкоминучий біль",
            "treatment": "Місцево препарати для зниження чутливості емалі.\r\nПризначення десенситайзерів."
        },
        {
            "name": "Гострий початковий карієс",
            "complaints": "Скарги на косметичний дефект твердих тканин зуба (виникнення плями), поява незначної чутливості, оскоми від різних подразників, переважно хімічних (кисле, солодке)",
            "research": "Ділянка емалі білого кольору, втратила природний блиск, матового відтінку, поверхня емалі шорсткувата, при зондуванні безболісна, досить тверда, при зондуванні відмічається шорсткість, незначна податливість та болючість поверхні плями, зафарбовуються при використанні карієс-маркера.",
            "treatment": ""
        },
        {
            "name": "Патологічне стирання",
            "complaints": "на зміну пропорцій обличчя, біль в СНЩС.\r\nЗниження висоти коронок зубів. \r\nКосметичні зміни",
            "research": "в групі зубів стертість коронок.\r\nЗондування і реакція на термічні подразники болюча.\r\nПеркусія неболюча",
            "treatment": "Послідовне відновлення висоти клінічних коронок."
        }
    ].reduce((u, i) => {
        return u.find(k => k.name === i.name) ? u : [...u, i]
    }, []).map(c => {
        return {
            "name": c.name,
            "complaints": c.complaints,
            "research": c.research,
            "treatment": c.treatment
        }
    });

    const services = [
        { number: 501, category: 'Дитяча стоматологія', name: 'Герметизація фісур', minPrice: 600 }, 
        { number: 101, category: 'Загальні послуги', name: 'Прицільний рентген', minPrice: 50 }, 
        { number: 601, category: 'Ортодонтія', name: 'Консультація', minPrice: 300 }, 
        { number: 301, category: 'Ортопедична стоматологія', name: 'Коронка металокерамічна', minPrice: 1500 }, 
        { number: 201, category: 'Терапевтична стоматологія', name: 'Пломбування 1 поверхні', minPrice: 400 }, 
        { number: 202, category: 'Терапевтична стоматологія', name: 'Гігієна', minPrice: 500 }
    ];

    const questionarie = {
        allergyReactions: "",
        hasAllergyReactions: false,
        hepatitisA: "",
        hasHepatitisA: false,
        hepatitisB: "",
        hasHepatitisB: false,
        hepatitisC: "",
        hasHepatitisC: false,
        tuberculosis: "",
        hasTuberculosis: false,
        hivAids: "",
        hasHivAids: false,
        asthma: "",
        hasAsthma: false,
        epilepsy: "",
        hasEpilepsy: false,
        cardioVascularPatology: "",
        hasCardioVascularPatology: false,
        dizziness: "",
        hasDizziness: false,
        heartFailure: "",
        hasHeartFailure: false,
        arrhythmia: "",
        hasArrhythmia: false,
        infarct: "",
        hasInfarct: false,
        hypertension: "",
        hasHypertension: false,
        hypotension: "",
        hasHypotension: false,
        bloodClotting: "",
        hasBloodClotting: false,
        anemia: "",
        hasAnemia: false,
        thyroidDiseases: "",
        hasThyroidDiseases: false,
        diabetes: "",
        hasDiabetes: false,
        tissueBonesDiseases: "",
        hasTissueBonesDiseases: false,
        tissueConnectiveDiseases: "",
        hasTissueConnectiveDiseases: false,
        kidneyAndUrinarySystemDiseases: "",
        hasKidneyAndUrinarySystemDiseases: false,
        benignFormation: "",
        hasBenignFormation: false,
        malignantFormation: "",
        hasMalignantFormation: false,
        operations: "",
        hasOperations: false,
        implants: "",
        hasImplants: false,
        regularCures: "",
        hasRegularCures: false,
        drugs: "",
        hasDrugs: false,
        smoking: "",
        hasSmoking: false,
        otherDiseases: "",
        hasOtherDiseases: false
    };

    const teeth = [
        {
            "id": 323873,
            "name": "Центральний різець",
            "location": 11
        },
        {
            "id": 323874,
            "name": "Боковий різець",
            "location": 12
        },
        {
            "id": 323875,
            "name": "Ікло",
            "location": 13
        },
        {
            "id": 323876,
            "name": "Перший премоляр",
            "location": 14
        },
        {
            "id": 323877,
            "name": "Другий премоляр",
            "location": 15
        },
        {
            "id": 323878,
            "name": "Перший моляр",
            "location": 16
        },
        {
            "id": 323879,
            "name": "Другий моляр",
            "location": 17
        },
        {
            "id": 323880,
            "name": "Третій моляр",
            "location": 18
        },
        {
            "id": 323881,
            "name": "Центральний різець",
            "location": 21
        },
        {
            "id": 323882,
            "name": "Боковий різець",
            "location": 22
        },
        {
            "id": 323883,
            "name": "Ікло",
            "location": 23
        },
        {
            "id": 323884,
            "name": "Перший премоляр",
            "location": 24
        },
        {
            "id": 323885,
            "name": "Другий премоляр",
            "location": 25
        },
        {
            "id": 323886,
            "name": "Перший моляр",
            "location": 26
        },
        {
            "id": 323887,
            "name": "Другий моляр",
            "location": 27
        },
        {
            "id": 323888,
            "name": "Третій моляр",
            "location": 28
        },
        {
            "id": 323889,
            "name": "Центральний різець",
            "location": 31
        },
        {
            "id": 323890,
            "name": "Боковий різець",
            "location": 32
        },
        {
            "id": 323891,
            "name": "Ікло",
            "location": 33
        },
        {
            "id": 323892,
            "name": "Перший премоляр",
            "location": 34
        },
        {
            "id": 323893,
            "name": "Другий премоляр",
            "location": 35
        },
        {
            "id": 323894,
            "name": "Перший моляр",
            "location": 36
        },
        {
            "id": 323895,
            "name": "Другий моляр",
            "location": 37
        },
        {
            "id": 323896,
            "name": "Третій моляр",
            "location": 38
        },
        {
            "id": 323897,
            "name": "Центральний різець",
            "location": 41
        },
        {
            "id": 323898,
            "name": "Боковий різець",
            "location": 42
        },
        {
            "id": 323899,
            "name": "Ікло",
            "location": 43
        },
        {
            "id": 323900,
            "name": "Перший премоляр",
            "location": 44
        },
        {
            "id": 323901,
            "name": "Другий премоляр",
            "location": 45
        },
        {
            "id": 323902,
            "name": "Перший моляр",
            "location": 46
        },
        {
            "id": 323903,
            "name": "Другий моляр",
            "location": 47
        },
        {
            "id": 323904,
            "name": "Третій моляр",
            "location": 48
        }
    ].map(x => ({ 
        "name": x.name,
        "location": x.location })
    );

    let initialServices = [];
    try {
        initialServices = await Service.find({});
    } finally {
        if (!initialServices.length) {
            Service.insertMany(services, (error, docs) => {
                if (!error) {
                    console.log("Services added");
                }
            });
        
        }
    } 

    let initialDiagnosis = [];
    try {
        initialDiagnosis = await Diagnosis.find({});
    } finally {
        if (!initialDiagnosis.length) {
            Diagnosis.insertMany(diagnosisForSave, (error, docs) => {
                if (!error) {
                    console.log("Diagnosis added");
                }
            });
        }
    } 

    let initialTeeth = [];
    try {
        initialTeeth = await Tooth.find({});
    } finally {
        if (!initialTeeth.length) {
            Tooth.insertMany(teeth, (error, docs) => {
                if (!error) {
                    console.log("Teeth added");
                }
            });
        }
    } 

}